content/posts/weekly-summary-2023-05-01.en.md
+++
title = "Weekly Summary 2023-05-01"
date = 2023-05-09T10:45:00+10:00
lastmod = 2023-05-09T10:45:24+10:00
tags = ["weekly"]
draft = false
weight = 2001
featuredImage = "/ox-hugo/weekly-summary-2023-05-01-cover.jpeg"
featuredImagePreview = "/ox-hugo/weekly-summary-2023-05-01-preview.jpeg"
+++

The cover features the little princess urging us to go to sleep.

<!--more-->


## What I Read {#what-i-read}


### [News Minimalist — Only significant news](https://www.newsminimalist.com/) {#news-minimalist-only-significant-news}

I prefer keeping things simple and clean, and this minimalist news app does everything I need.


### [Passkeys: What they are and how to use them](https://blog.google/technology/safety-security/the-beginning-of-the-end-of-the-password/) {#passkeys-what-they-are-and-how-to-use-them}

Google's Passkeys seem interesting. I'm curious about when we'll see broader use cases that aren't limited to just a few companies. I also wonder about support for people with blurred fingerprints. I tried following the setup process from the provided link, but to be honest, the experience could be better.


### [Googlers angry about CEO’s $226M pay after cuts in perks and 12,000 layoffs](https://arstechnica.com/tech-policy/2023/05/googlers-angry-about-ceos-226m-pay-after-cuts-in-perks-and-12000-layoffs/) {#googlers-angry-about-ceo-s-226m-pay-after-cuts-in-perks-and-12-000-layoffs}

It's unlikely that a CEO would be deeply concerned about every employee. As employees, our main focus should be doing our jobs, getting paid, and moving forward.


### [erikw/vim-keybindings-everywhere-the-ultimate-list](https://github.com/erikw/vim-keybindings-everywhere-the-ultimate-list) {#erikw-vim-keybindings-everywhere-the-ultimate-list}

Vim forever!


### [fast.ai - Mojo may be the biggest programming language advance in decades](https://www.fast.ai/posts/2023-05-03-mojo-launch.html) {#fast-dot-ai-mojo-may-be-the-biggest-programming-language-advance-in-decades}

Mojo, it'll be interesting to see if it becomes the next trending programming language. It's amusing that the 🔥 emoji can be used as the file extension for Mojo.


## What I Watched {#what-i-watched}


### [ChatGPT Prompt Engineering for Developers](https://www.deeplearning.ai/short-courses/chatgpt-prompt-engineering-for-developers/) {#chatgpt-prompt-engineering-for-developers}

It's been a week since Andrew Ng's guide came out. I've been meaning to take a look at it, but I keep making all sorts of excuses not to. I'll set a goal for myself, hoping to thoroughly review it next week.


### [Guardians of the Galaxy Vol. 3 (2023) - IMDb](https://www.imdb.com/title/tt6791350/) {#guardians-of-the-galaxy-vol-dot-3--2023--imdb}

Last week, I was complaining about the lackluster fourth phase of the Marvel Cinematic Universe. But this Sunday, I saw a long-awaited great Marvel movie. The director's aesthetic taste is as impressive as ever, with excellent visuals and sound. If only every film in the fourth phase were of this caliber! This should be the last Guardians of the Galaxy movie, but there's no need for regrets. We must say goodbye to the past, move forward, and never look back.


## What I Did {#what-i-did}


### This guy is quite lazy; he didn't do anything this week. {#this-guy-is-quite-lazy-he-didn-t-do-anything-this-week-dot}
